app/controllers/projects_controller.rb

  def index
    @projects = PivotalTracker::Project.all
    #Stores to db
    Membership.delete_all([user_id=?", user.id])
    @projects.each do |project|
      cur_project = Project.find(:first, :conditions=>["pid=?", project.id])
      if cur_project.nil?
        cur_project = Project.new
      end
      cur_project.pid = project.id
      cur_project.name = project.name
      cur_project.iteration_length = project.iteration_length
      cur_project.week_start_day = project.week_start_day
      cur_project.point_scale = project.point_scale
      #cur_project.account = project.account
      cur_project.velocity_scheme = project.velocity_scheme
      cur_project.current_velocity = project.current_velocity
      cur_project.initial_velocity = project.initial_velocity
      cur_project.last_activity_at = project.last_activity_at
      cur_project.save
      @members = project.memberships.all
      @members.each do |member|
        user = User.find(:first, :conditions=>["email=?", member.email])
        if user.nil?
          user = User.new
          user.login = member.email
          user.email = member.email
          user.password = member.email
          user.fullname = member.name
          user.save
---
SELECT * FROM `projects` WHERE (pid=83109) LIMIT 1
DELETE FROM `memberships` WHERE (project_id=1)
INSERT INTO `projects` (`pid`, `name`, `bugs_and_chores_are_estimatable`, `commit_mode`, `iteration_length`, `week_start_day`, `account`, `public`, `current_velocity`, `allow_attachments`, `last_activity_at`, `point_scale`, `initial_velocity`, `velocity_scheme`, `number_of_done_iterations_to_show`, `use_https`, `labels`) VALUES(83109, 'ptbarnum', 0, 0, 1, 'Monday', NULL, 0, 10, 0, NULL, '0,1,2,3,5,8', 10, 'Average of 3 iterations', NULL, 0, NULL)
UPDATE `projects` SET `last_activity_at` = '2010-05-20 13:54:35' WHERE `id` = 0
SELECT * FROM `memberships` WHERE (project_id=0 and user_id=172) LIMIT 1
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'michaeloboyle@michaeloboyle.com' AND `users`.id <> 172) LIMIT 1
INSERT INTO `memberships` (`project_id`, `role`, `user_id`) VALUES(0, 'Owner', 172)
INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `fullname`, `login`, `email`, `created_at`) VALUES('43b4079642a13fd5a1ed41f6ee1ab7546cd18662', '2010-05-28 08:52:24', '7f463f1a220e14c2b78d62bd6d44b2b4cb80f9d1', 'Michael J O\'Boyle', 'michaeloboyle@michaeloboyle.com', 'michaeloboyle@michaeloboyle.com', '2010-05-28 08:52:24')
UPDATE `users` SET `updated_at` = '2010-05-28 08:52:24', `fullname` = 'Bhana Prasad' WHERE `id` = 1

  def show
    begin
      project = Project.find(params[:id])
      @project = PivotalTracker::Project.find(project.pid)
      @members = @project.memberships.all
      @members.each do |member|
          user = User.find(:first, :conditions=>["email=?", member.email])
          if user.nil?
            user = User.new
            user.login = member.email
            user.email = member.email
            user.password = member.email
            user.fullname = member.name
            user.save
          else
            user.fullname = member.name
            user.save
          end
          #associate user to project
          membership = Membership.find(:first, :conditions=>["project_id=? and user_id=?", params[:id].to_i, user.id])
          if membership.nil?
            membership = Membership.new
            membership.project_id = params[:id].to_i
            membership.user_id = user.id
            membership.role = member.role
            membership.save
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 12)
SELECT * FROM `memberships` WHERE (project_id=83109 and user_id=172) LIMIT 1
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'michaeloboyle@michaeloboyle.com' AND `users`.id <> 172) LIMIT 1
INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `fullname`, `login`, `email`, `created_at`) VALUES('442c61880b536d748a90f0737f7cdb9aba48adb5', '2010-05-21 14:20:58', '2c211595a1dcf6ce44cedaffd832091ad4d938aa', 'Michael J O\'Boyle', 'michaeloboyle@michaeloboyle.com', 'michaeloboyle@michaeloboyle.com', '2010-05-21 14:20:58')
UPDATE `users` SET `updated_at` = '2010-05-21 14:23:25', `fullname` = 'Bhana Prasad' WHERE `id` = 171
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`login`) = BINARY 'michaeloboyle@michaeloboyle.com' AND `users`.id <> 172) LIMIT 1
INSERT INTO `memberships` (`project_id`, `role`, `user_id`) VALUES(83109, NULL, 172)