app/controllers/sessions_controller.rb

  def create
    @email=params[:email]
    begin
      PivotalTracker::Client.token(params[:email], params[:password])
    rescue
      flash[:login_error] = "Invalid login or password"
      render :action =>"new"
    else
      self.current_user = User.authenticate(params[:email], params[:password])
      if logged_in?
        user = self.current_user
        user.login = params[:email]
        user.email = params[:email]
        user.password = params[:password]
        user.save
---
INSERT INTO `users` (`salt`, `status`, `reminder`, `updated_at`, `is_blocked`, `online`, `crypted_password`, `last_seen_at`, `remember_token_expires_at`, `admin`, `staff`, `phone_number`, `default_avatar`, `remember_token`, `posts_count`, `first_name`, `login`, `last_name`, `last_ping`, `email`, `created_at`, `middle_name`, `homepage_view_count`) VALUES('39b65336dd06840badfa3db35b0749f466b1834a', NULL, 0, '2010-05-20 16:40:48', 0, 0, '40bbde6cc1c5c86849777a6f9f129c78e8b264ac', NULL, NULL, 0, 0, NULL, NULL, NULL, 0, NULL, 'bhanuprasad143@gmail.com', NULL, NULL, 'bhanuprasad143@gmail.com', '2010-05-20 16:40:48', NULL, 0)