app/controllers/stories_controller.rb

SELECT * FROM `projects` INNER JOIN `memberships` ON `projects`.id = `memberships`.project_id WHERE (`memberships`.user_id = 171 )
SELECT * FROM `stories` WHERE (pid=3590834) LIMIT 1
INSERT INTO `stories` (`pid`, `current_state`, `name`, `accepted_at`, `project_id`, `requested_by`, `story_type`, `url`, `lighthouse_url`, `description`, `estimate`, `lighthouse_id`, `labels`, `owned_by`, `created_at`) VALUES(3704832, 'unstarted', 'drag and drop stories', NULL, 2, 'Michael J O\'Boyle', 'feature', 'http://www.pivotaltracker.com/story/show/3704832', NULL, 'drag and drop stories to change priority. commit changes to pivotaltracker.com', -1, NULL, 'workload', 'Bhana Prasad', '2010-05-28 11:48:30')
UPDATE `stories` SET `estimate` = 1, `current_state` = 'finished' WHERE `id` = 10
---
  def index
    @projects = current_user.projects
    #Stores to db
    @stories = []
    @projects.each do |project|
      @project = PivotalTracker::Project.find(project.pid)
      stories = @project.stories.all(:owned_by=>current_user.fullname)
      @stories[project.id] = stories
      stories.each do |story|
        r_story = Story.find(:first, :conditions=>["pid=?", story.id])
        if r_story.nil?
          r_story = Story.new
        end
        r_story.project_id = project.id
        r_story.pid = story.id
        r_story.story_type = story.story_type
        r_story.url = story.url
        r_story.estimate = story.estimate
        r_story.current_state = story.current_state
        #r_story.lighthouse_id = story.lighthouse_id
        #r_story.lighthouse_url = story.lighthouse_url
        r_story.description = story.description
        r_story.name = story.name
        r_story.requested_by = story.requested_by
        r_story.owned_by = story.owned_by
        r_story.created_at = story.created_at
        r_story.accepted_at = story.accepted_at
        r_story.labels = story.labels
        r_story.save

SELECT * FROM `stories` WHERE (pid='3704832') LIMIT 1
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
---
  def move
    target = params[:target]
    move = params[:move]
    story_pid = params[:story]
    story = Story.find(:first, :conditions=>["pid=?", story_pid])
    project_pid = story.project.pid
    @project = PivotalTracker::Project.find(project_pid)