app/controllers/users_controller.rb

  def index
    @users = User.find(:all)
---
SELECT * FROM `users` WHERE (id in (select user_id from memberships where project_id in (select project_id from memberships where user_id=3)))

  def show
    @user = User.find(params[:id])
    @projects = @user.projects
    #Stores to db
    @stories = []
    @projects.each do |project|
      begin
        @project = PivotalTracker::Project.find(project.pid)
        stories = @project.stories.all(:owned_by=>@user.fullname)
        @stories[project.id] = stories
        stories.each do |story|
          r_story = Story.find(:first, :conditions=>["pid=?", story.id])
          if r_story.nil?
            r_story = Story.new
          end
          r_story.project_id = project.id
          r_story.pid = story.id
          r_story.story_type = story.story_type
          r_story.url = story.url
          r_story.estimate = story.estimate
          r_story.current_state = story.current_state
          #r_story.lighthouse_id = story.lighthouse_id
          #r_story.lighthouse_url = story.lighthouse_url
          r_story.description = story.description
          r_story.name = story.name
          r_story.requested_by = story.requested_by
          r_story.owned_by = story.owned_by
          r_story.created_at = story.created_at
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `projects` INNER JOIN `memberships` ON `projects`.id = `memberships`.project_id WHERE (`memberships`.user_id = 1 )
SELECT * FROM `stories` WHERE (pid=3590834) LIMIT 1
INSERT INTO `stories` (`pid`, `current_state`, `name`, `accepted_at`, `project_id`, `requested_by`, `story_type`, `url`, `lighthouse_url`, `description`, `estimate`, `lighthouse_id`, `labels`, `owned_by`, `created_at`) VALUES(3590834, 'accepted', 'retrieve list of user\'s projects', '2010-05-24 15:12:06', 2, 'Michael J O\'Boyle', 'feature', 'http://www.pivotaltracker.com/story/show/3590834', NULL, 'to be stored in mysql db', 2, NULL, 'login', 'Bhana Prasad', '2010-05-19 15:14:53')